"""Многострочники"""

"""
1) Определить название функции. Оно должно быть информативным,
чтобы было понятно назначение функции.
"""

"""
2) Определить в строках документации назначение функции,
типы данных ее параметров и тип данных результата.
Можно также указать пример вызова функции с параметром и возвращаемый результат.
"""

"""
3) Определить информативные имена параметров, передаваемых в функцию,
написать тело функции с возвращаемым результатом (при необходимости).
"""
my_func
new_func

profit_calc
out_data
inp_data
res_logg
on_valid_data

def rectangle_area_calc(length, width):
    """
    Возвращает площадь прямоугольника по длине и ширине

    (number, number) -> number

    >>> rectangle_area_calc(10, 10)
    100
    """
    return length * width


def profit_calc(total, costs):
    """
    Ф-ция для расчета фин рез-та
    :param total: выручка
    :param costs: затраты
    :return: возвращает финансовый рез-т
    """
    res = total - costs
    return res