"""Основные методы строк"""

# Возвращает длину строки
print(len("my_string"))  # -> 9

# Разбить строку по разделителю
print("раз два три".split())  # -> ['раз', 'два', 'три']
print("четыре_пять_шесть".split('_'))  # -> ['четыре', 'пять', 'шесть']

# Собрать строку из списка с указанным разделителем
print('_'.join(['раз', 'два', 'три']))  # -> раз_два_три
print(''.join(['раз', 'два', 'три']))  # -> раздватри

# Перевести первую букву каждого слова в верхний регистр, остальные - в нижний
print("ехал грека через реку".title())  # -> Ехал Грека Через Реку

# Преобразовать строку к верхнему регистру
print('простая строка'.upper())  # -> ПРОСТАЯ СТРОКА

# Преобразовать строку к нижнему регистру
print('ПРОСТАЯ СТРОКА'.lower())   # -> простая строка

# Проверить, начинаются ли слова строки с буквы в верхнем регистре
print('Ехал Грека Через Реку'.istitle())  # -> True
print('Ехал Грека Через реку'.istitle())  # -> False

# Проверить, состоит ли строка из символов в верхнем регистре
print('ПРОСТАЯ СТРОКА'.isupper())  # -> True
print('простая строка'.isupper())  # -> False

# Проверить, состоит ли строка из символов в нижнем регистре
print('простая строка'.islower())  # -> True
print('ПРОСТАЯ СТРОКА'.islower())  # -> False

# Получить ASCII-код для символа
print(ord('b'))  # -> 98

# Получить символ по ASCII-коду
print(chr(98))  # -> 'b'

# Вернуть количество вхождений подстроки в строку
print('рарара'.count('ра'))  # -> 3
print('рарара'.count('ра', 2, 4))  # -> 1

# Перевести первый символ строки в верхний регистр, остальные - в нижний
print('cТРОКА'.capitalize())  # -> Cтрока

# Проверить, начинается ли строка с шаблона
print('рарара'.startswith('ра'))  # -> True
print('рарара'.startswith('не'))  # -> False

# Проверить, заканчивается ли строка шаблоном
print('рарара'.endswith('ра'))  # -> True
print('рарара'.endswith('не'))  # -> False

# Заменить в строке шаблон на указанную подстроку
print('рарара'.replace('ра', 'не'))  # -> 'ненене'

# Найти подстроку в строке. Получить позицию первого вхождения или получить ValueError
print('рарарара'.index('ра'))  # -> 0
print('рарарара'.index('ра', 4, 6))  # -> 4
print('рарарара'.index('ра', 10, 20))  # -> ValueError: substring not found

# Найти подстроку в строке. Получить позицию первого вхождения или получить -1
print('рарарара'.find('ра'))  # -> 0
print('рарарара'.find('ра', 4, 6))  # -> 4
print('рарарара'.find('ра', 10, 20))  # -> -1
