"""Модуль shutil"""
from shutil import copyfileobj, copyfile, copy, rmtree, move

# 1) Копирование содержимого одного файлового объекта (f_obj_1) в другой (f_obj_2)
copyfileobj(f_obj_1, f_obj_2)

# 2) Копирование содержимого (но не метаданных) одного файла (f_1) в другой (f_2)
copyfile(f_1, f_2)

# 3) Копирование содержимого файла my_f  в файл или папку my_target
# Если копирование выполняется в директорию, файл копируется с исходным именем (my_f)
copy(my_f, my_target)

# 4) Рекурсивное копирование дерева директорий my_tree в папку my_target
copy(my_tree, my_target)

# 5) Удаление текущей директории и всех поддиректорий
rmtree(path)

# 6) Рекурсивное перемещение файла или директории (my_obj) в нужную директорию (my_target)
move(my_obj, my_target)
