"""Функция range() для многократно выполняемых действий"""

print(list(range(7)))  # целые числа в диапазоне [0, 7) -> [0, 1, 2, 3, 4, 5, 6]
print(list(range(2, 8)))  # целые числа в диапазоне [2, 8) -> [2, 3, 4, 5, 6, 7]
print(list(range(1, 9, 2)))  # целые числа в диапазоне [1, 9) с шагом 2 -> [1, 3, 5, 7]
print(list(range(1, -7, -2)))  # целые числа в диапазоне [1, -7) с шагом -2 -> [1, -1, -3, -5]
print(list(range(0)))  # целые числа в диапазоне (0, 0) -> []
print(list(range(1, 0)))  # целые числа в диапазоне (1, 0) -> []\
print(list(range(1, 2)))

for el in range(4, 20, 4):
    res = el / 2
    print(f"Результат деления {el} на 2: {int(res)}")

"""
Результат деления 4 на 2: 2
Результат деления 8 на 2: 4
Результат деления 12 на 2: 6
Результат деления 16 на 2: 8
"""
